"Нульова затримка" у функції setTimeout означає використання значення затримки рівного 0 мс, як у цьому коді та це не означає, що код виконається миттєво:

setTimeout(function() {
  console.log('Цей код виконається пізніше');
}, 0);

"Нульова затримка" насправді відкладає виконання функції до завершення поточного виконання синхронного коду і до тих пір, поки не буде очищена черга завдань (callback queue) в циклі подій (event loop).

Навіть із затримкою в 0 мс, функція буде виконана лише після того, як всі інші поточні синхронні операції завершаться, і на черзі не залишиться жодних мікротасків (наприклад, промісів). Це зручно для планування асинхронних операцій, які потрібно виконати після завершення поточного блоку коду.